Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: On a related note, the contents of the address bar and status bar can be retrieved as demonstrated at www.autohotkey.com/forum/topic19255.html.
fr: Dans le même thème, le contenu de la barre d'adresse et de la barre de statut peut être récupéré comme montré ici www.autohotkey.com/forum/topic19255.html.

source: On some systems you may need to enclose the name in quotes to ensure the editor does not add another extension (such as .txt).
fr: Sur certains systèmes il peut être nécessaire de mettre le nom du fichier entre guillemets (") pour s'assurer que l'éditeur n'ajoute pas une autre extension (comme .txt).

source: On the ControlGetText page you will see this:
fr: Sur la page ControlGetText par exemple :

source: On the left side of traditional (non-expression) if-statements:
fr: Du côté gauche d'une instruction if traditionnelle (non-expression) :

source: On the left side of an assignment:
fr: Du côté gauche d'une affectation :

source: On the left side of legacy (non-expression) if-statements:
fr: Du côté gauche d'une instruction if en mode dépassé (non-expression) :

source: Once a script is compiled, it becomes a standalone executable; that is, AutoHotkey.exe is not required in order to run the script.
fr: Une fois qu'un script est compilé, il devient un exécutable indépendant ; c'est-à-dire que AutoHotkey.exe n'est pas requis pour exécuter le script.

source: Once done, great!
fr: Une fois que c'est fini, super !

source: Once it is enabled, launch your script file by right-clicking it and selecting Run with UI Access, or use a command line like "AutoHotkeyU32_UIA.exe" "Your script.ahk" (but include full paths).
fr: Une fois activée, lancer le fichier de script par un clic droit dessus et sélectionner Run with UI Access (Lancer avec accès UI), ou utiliser la ligne de commande comme "AutoHotkeyU32_UIA.exe" "Mon script.ahk" (mais bien inclure les chemins complets).

source: Once the debugger client is connected, it may detach without terminating the script by sending the "detach" DBGp command.
fr: Une fois le client débogueur connecté, il peut se détacher sans terminer le script en envoyant la commande DBGp "detach".

source: Once you have AutoHotkey installed, you will probably want it to do stuff.
fr: Une fois AutoHotkey installé, il serait bien que ça fasse quelque chose.

source: One alternative is to use the Format function, which can also format the parameter value in various ways.
fr: Une alternative est d'utiliser la fonction Format, qui peut aussi formater la valeur d'un paramètre de différentes manières.

source: One common mistake is to write = where := is needed.
fr: Une erreur courante est d'écrire = là où := est nécessaire.

source: One common suggestion is to upload the file to an online service such as virustotal or Jotti and see what other antivirus programs have to say.
fr: Une suggestion courante est de télécharger le fichier vers un service en ligne comme virustotal ou Jotti et voir ce que d'autres programmes antivirus ont à dire.

source: One important consequence is that you cannot define one subroutine inside another subroutine, because the "body" of the inner subroutine would execute automatically and then return, effectively terminating the outer subroutine.
fr: Une conséquence importante est qu'il est impossible de définir un sous-programme à l'intérieur d'un sous-programme, car le "corps" du sous-programme interne serait exécuté automatiquement puis terminerait au return, terminant du même coup le sous-programme externe.

source: One of the most common issues with AutoHotkey involving variables is when to use the percent signs (%).
fr: Un des problèmes les plus fréquents avec AutoHotkey à propos des variables est l'utilisation des signes pourcentage (%).

source: One way to work around this is to do a series of concatenations into a variable.
fr: Une manière de contourner ce problème est d'effectuer une série de concaténations dans une variable.

source: One work-around is to compile the script then drag the files onto the resulting EXE.
fr: Une solution est de compiler le script puis de déposer les fichiers sur l'EXE résultant.

source: Open - Open the script's main window.
fr: Open - Ouvre la fenêtre principale du script.

source: Open it.
fr: Ouvrez-le.

source: Open notepad or (anything you can type in) and press Ctrl and J.
fr: Ouvrir Notepad (n'importe quoi où la frappe est possible) et Ctrl et J.

source: Operators
fr: Opérateurs

source: Operators for Objects
fr: Opérateurs pour Objets

source: Operators of equal precedence such as multiply (*) and divide (/) are evaluated in left-to-right order unless otherwise specified in the operator table.
fr: Des opérateurs de même priorité comme la multiplication (*) et la division (/) sont évalués dans l'ordre de gauche à droite sauf indiqué autrement dans le tableau des opérateurs.

source: Optional Parameters
fr: Paramètres Facultatifs

source: Optional parameters can simply be left blank.
fr: Les paramètres facultatifs ou optionnels peuvent simplement être laissés vides.

source: Or add in some more details:
fr: Ou d'ajouter plus de détails :

source: Or look for "AutoHotkey Help File" or "AutoHotkey.chm" in the start menu or your installation directory.
fr: Ou chercher "AutoHotkey Help File" ou "AutoHotkey.chm" dans le menu démarrer ou le dossier d'installation.

source: Other Examples?
fr: D'autres exemples ?

source: Other Helpful Goodies
fr: Autres Notions Utiles

source: Other Keys
fr: Autres Touches

source: Other links
fr: Autres liens

source: Other:
fr: Autre:

source: Otherwise, it is blank.
fr: Dans le cas contraire, elle est vide.

source: Otherwise, it will stay running in an idle state, responding to events such as hotkeys, hotstrings, GUI events, custom menu items, and timers.
fr: Sinon, son exécution continuera dans un état de veille, et réagira aux évènements liés aux hotkeys, hotstrings, évènements de GUI, éléments de menu personnalisé, et minuteries.

source: Otherwise, the default is Unicode 32-bit or Unicode 64-bit depending on whether the OS is 64-bit.
fr: Sinon, la version par défaut est Unicode 32-bit ou Unicode 64-bit selon si le système d'exploitation est 64-bit ou non.

source: Otherwise, the position of a function definition does not matter; any function defined within the script can be called from anywhere else.
fr: A part ce point, la position de la définition d'une fonction n'a pas d'importance ; toute fonction définie dans le script peut être appelée de n'importe où.

source: Otherwise, the word Join should be followed immediately by as many as 15 characters.
fr: Sinon, le mot Join devrait être immédiatement suivi d'au plus 15 caractères.

source: Output := SubStr("I'm scripting, awesome!", 16)
fr: Output := SubStr("Génial je scripte !", 16)

source: OutputVar
fr: VarSortie

source: OutputVar and InputVar Parameters
fr: Paramètres VarSortie et VarEntree

source: Parameters containing spaces should be enclosed in double quotes.
fr: Les paramètres contenant des espaces doivent être entourés de guillemets.

source: Parentheses may be used to override precedence as in this example:
fr: Les parenthèses peuvent être utilisées pour définir les priorités comme dans cette exemple :

source: Pass the /R switch to automatically reload these scripts using whichever EXE they were running on, without command line args.
fr: Passer le commutateur /R permet de relancer automatiquement ces scripts en utilisant le quelconque EXE avec lequel ils étaient exécutés, sans les arguments de ligne de commande.

source: Passing Command Line Parameters to a Script
fr: Passer des Paramètres de Ligne de Commande à un Script

source: Pause Script - Pause or unpause the script.
fr: Pause Script - Pause ou reprend le script.

source: People usually use 3 or 4 spaces or 1 tab per "level".
fr: En général 3 ou 4 espaces, ou 1 tabulation sont utilisées par "niveau".

source: Percent signs can also have other meanings:
fr: Les signes pourcentage peuvent aussi avoir d'autres interprétations :

source: Percent signs should not be used anywhere else, except to create a dynamic variable reference or dynamic function call.
fr: Les signes pourcentage ne devraient pas être utilisés dans d'autres cas, sauf pour créer une référence dynamique de variable ou un appel dynamique de fonction.

source: Play/Pause
fr: Lecture/Pause

source: Please note that you cannot IGNORE parameters, but you can leave them blank.
fr: Bien faire attention au fait que les paramètres ne peuvent pas être ignorés, mais juste laissés vides.

source: Please pay attention to the equal sign (=).
fr: Une attention particulière est à prêter au signe égal (=).

source: Pointer Size
fr: Taille du pointeur

source: Pop method
fr: Méthode Pop (sortir)

source: Portability of AutoHotkey.exe
fr: Portabilité de AutoHotkey.exe

source: Post anything you have tried.
fr: Montrer tout ce qui a été tenté sans succès.

source: PostMessage, 0x111, 65303,,, Script's File Name.ahk - AutoHotkey
fr: PostMessage, 0x111, 65303,,, Nom du Fichier de Script.ahk - AutoHotkey

source: PostMessage, 0x111, 65305,,, Script's File Name.ahk - AutoHotkey
fr: PostMessage, 0x111, 65305,,, Nom du Fichier de Script.ahk - AutoHotkey

source: PostMessage, 0x111, 65306,,, Script's File Name.ahk - AutoHotkey
fr: PostMessage, 0x111, 65306,,, Nom du Fichier de Script.ahk - AutoHotkey

source: Press Win+R to open the Run dialog, then enter shell:startup and click OK or Enter.
fr: Appuyer sur Win+R pour ouvrir la boîte de dialogue Exécuter, puis entrer shell:startup et cliquer sur OK ou appuyer sur Entrée.

source: Press one of the "mystery keys" on your keyboard.
fr: Appuyez sur l'une des «touches mystère» de votre clavier.

source: Pressing the same hotkey again will stop it.
fr: Activer encore la même hotkey arrêtera la boucle.

source: Pretend everyone but you is a doorknob and knows nothing.
fr: Faire la supposition que tout le monde sauf vous est ignorant et ne sait rien.

source: Previous Track
fr: Piste précédente

source: Previously this caused the thread to silently exit.
fr: Auparavant, cela provoquait la fermeture silencieuse du thread.

source: PrintScreen
fr: Impr. écran

source: Probably C:\ drive.
fr: Probablement C:\.

source: ProductIsAvailable := (Color = "Red")
fr: ProduitDisponible := (Couleur = "Rouge")

source: Provides a string consisting of zero or more of the following letters to indicate the joystick's capabilities:
fr: Fournit une chaîne de texte composée de zéro ou plus des lettres suivantes pour indiquer les capacités du joystick:

source: Providing a full explanation of what each construct does would require introducing more concepts which are outside the scope of this section.
fr: Fournir une explication complète de ce que chaque syntaxe accomplit nécessiterait d'introduire d'autres concepts ne relevant pas de cette section.

source: Pseudo-arrays
fr: Pseudo-tableaux

source: Push method
fr: Méthode Push (pousser)

source: Quick Reference
fr: Référence Rapide

source: Quick Reference | AutoHotkey
fr: Référence Rapide | AutoHotkey

source: Quoted strings can contain escape sequences such as `t (tab), `n (linefeed), and `r (carriage return).
fr: Les chaînes entre guillemets peuvent contenir des séquences échappées comme `t (tabulation), `n (saut de ligne), et `r (retour chariot).

source: RControl (or RCtrl)
fr: RControl (ou RCtrl)

source: Rajat created this script.
fr: Rajat a créé ce script.

source: Recognizes unusual keys not mentioned above.
fr: Reconnaît les touches inhabituelles non mentionnées ci-dessus.

source: Reconfigure the software that came with your mouse or keyboard (sometimes accessible in the Control Panel or Start Menu) to have the "mystery key" send some other keystroke.
fr: Reconfigurez le logiciel fourni avec votre souris ou votre clavier (parfois accessible dans le Panneau de configuration ou le menu Démarrer) pour que la "touche mystère" envoie une autre frappe.

source: Redirecting to AutoHotkey.htm.
fr: Redirection vers AutoHotkey.htm.

source: Redirecting to docs/AutoHotkey.htm.
fr: Redirection vers docs/AutoHotkey.htm.

source: Refresh
fr: Actualiser

source: RegEx quick reference
fr: Référence rapide RegEx

source: Regardless of the particular mouse, Send and Click can be used to scroll horizontally in programs which support it.
fr: Indépendamment d'une souris particulière, Send et Click peuvent être utilisés pour faire défiler horizontalement dans les programmes qui le supportent.

source: Registers the context menu option to run the appropriate exe file.
fr: Enregistre l'option du menu contextuel comme lançant l'exécutable approprié.

source: Related topics:
fr: Sujets connexes :

source: Reload This Script - See Reload.
fr: Reload This Script - Voir Reload.

source: Remapping keys and buttons
fr: Réaffecter touches et boutons

source: Remarks
fr: Remarques

source: RemoveAt method
fr: Méthode RemoveAt (enlève à)

source: RemovedValue := MyObject.Delete(AnyKey)
fr: ValeurEnlevee := MonObjet.Delete(UneClef)

source: RemovedValue := MyObject.RemoveAt(Index)
fr: ValeurEnlevee := MonObjet.RemoveAt(Index)

source: Replacement
fr: Remplacement

source: Requires Windows Vista or later.
fr: Nécessite Windows Vista ou une version ultérieure.

source: Respond to signals from hand-held remote controls via the WinLIRC client script.
fr: Répondez aux signaux des télécommandes portables via le script client WinLIRC.

source: Results may be less than ideal if it has not.
fr: Le résultat peut être loin d'être idéal dans le cas contraire.

source: Right Alt.
fr: La touche Alt de la droite.

source: Right Control.
fr: La touche Ctrl de la droite.

source: Right Shift.
fr: La touche Maj de la droite.

source: Right Win.
fr: La touche Win de la droite.

source: Right click inside the window, and click "Paste Shortcut".
fr: Cliquer droit dans la fenêtre, et cliquer "Coller le raccourci".

source: Right-Click on your desktop.
fr: Clic droit sur le bureau.

source: Right-click the tray icon to show the tray menu, which has the following options by default:
fr: Clic droit sur l'icône pour afficher le menu, qui par défaut est constitué des choix suivants :

source: Run Script
fr: Run Script (exécuter le script)

source: Run a Script
fr: Exécuter un Script

source: Run and RunWait interpret Target differently
fr: Run et RunWait interprètent Target différemment

source: Run as administrator (if UAC was enabled when AutoHotkey was installed)
fr: Run as administrator (exécuter le script en tant qu'administrateur) (if UAC was enabled when AutoHotkey was installed)

source: Run the "Convert .ahk to .exe" item in the Start Menu.
fr: Lancer l'option "Convert .ahk to .exe" (Convertir .ahk en .exe) dans le Menu Démarrer.

source: Run the script as administrator.
fr: Exécuter le script en tant qu'administrateur.

source: Run this code to see your AHK version:
fr: Exécuter ce code pour afficher la version de AutoHotkey :

source: Run with UI Access
fr: Lancer avec accès UI (Run with UI Access)

source: Run with UI Access (if the option was enabled during installation)
fr: Run with UI Access (exécuter le script avec accès UI) (si l'option a été activé lors de l'installation)

source: Run with UI Access [v1.1.24.02+]
fr: Lancer avec accès UI (Run with UI Access) [v1.1.24.02+]

source: Run, %A_ProgramFiles%\Some Application\App.exe, %A_ProgramFiles%\Some Application
fr: Run, %A_ProgramFiles%\Une Application\App.exe, %A_ProgramFiles%\Une Application

source: Run, %A_ProgramFiles%\Some_Program\Program.exe
fr: Run, %A_ProgramFiles%\Un_Programme\Programme.exe

source: Run, http://www.google.com
fr: Run, https://www.google.com

source: Run, http://www.google.com/
fr: Run, https://www.google.com/

source: Running Programs & Websites
fr: Lancer Programmes & Sites Web

source: Running a non-UIA script which uses a mouse hook (even as simple as #InstallMouseHook) may prevent all mouse hotkeys from working when the mouse is pointing at a window owned by a UIA script, even hotkeys implemented by the UIA script itself.
fr: Exécuter un script non-UIA utilisant un hook souris (même aussi simple que #InstallMouseHook) peut empêcher les hotkeys souris de fonctionner quand le pointeur est sur une fenêtre possédée par un script UIA, même les hotkeys implementés par le script UIA lui-même.

source: Same as above, but you are assigning a value of a variable to another variable.
fr: Comme ci-dessus, mais la valeur d'une variable est affectée à une autre variable.

source: Same with hotkeys.
fr: De même avec les hotkeys.

source: Save the File.
fr: Sauvegarder le fichier.

source: Save the script as UTF-8 with BOM.
fr: Enregistrer le fichier en UTF-8 avec BOM.

source: Script Compatibility
fr: Compatibilité des scripts

source: Script Compatibility | AutoHotkey
fr: Compatibilité des scripts | AutoHotkey

source: Script File Codepage [AHK_L 51+]
fr: Codepage de Fichier de Script [AHK_L 51+]

source: Script Showcase
fr: Vitrine de Scripts

source: Script files containing functions can be automatically included without having to use #Include, if they are saved in a standard location and named appropriately.
fr: Les fichiers de script contenant des fonctions peuvent être inclus automatiquement sans utiliser #Include, si ils sont enregistrés dans un emplacement standard et nommés convenablement.

source: ScriptPath := ""
fr: CheminScript := ""

source: Scripting Language
fr: Langage de Script

source: Scripting Language | AutoHotkey
fr: Langage de Script | AutoHotkey

source: Scripts - Definition & Usage | AutoHotkey
fr: Scripts - Définition & Utilisation | AutoHotkey

source: Scripts are also forced to exit when Windows shuts down.
fr: Les scripts sont aussi forcés de s'arrêter avec l'arrêt de Windows.

source: Scripts can also be compiled; that is, combined together with an AutoHotkey binary file to form a self-contained executable (.exe) file.
fr: Les scripts peuvent aussi être compilés ; c'est-à-dire combinés avec un fichier binaire AutoHotkey pour former un fichier exécutable (.exe) indépendant.

source: Scripts can also call subroutines directly, by using Gosub.
fr: Les scripts peuvent aussi appeler directement des sous-programmes, en utilisant Gosub.

source: Scripts can be commented by using a semicolon at the beginning of a line.
fr: Les scripts peuvent être commentés en utilisant un point-virgule au début d'une ligne.

source: Scripts support command line parameters.
fr: Les scripts prennent en charge les paramètres de ligne de commande.

source: Scripts use subroutines to define what should happen when a particular hotkey is pressed or some other event occurs.
fr: Les scripts utilisent des sous-programmes pour définir ce qui devrait se passer quand une hotkey particulière est enfoncée ou quand d'autres évènements se produisent.

source: Scripts which need to run other scripts with UI access can simply Run the appropriate UIA.exe file with the normal command line parameters.
fr: Les scripts ayant besoin de lancer d'autres scripts avec UI access (accès UI) peuvent simplement utiliser la commande Run et le fichier UIA.exe approprié avec les paramètres normaux de ligne de commande.

source: Scroll down to the bottom of the page.
fr: Faites défiler vers le bas de la page.

source: Search
fr: Rechercher

source: Search within all Program Files folders for AutoHotkey.
fr: Chercher AutoHotkey dans tous les dossiers de Program Files.

source: See #ErrorStdOut for details.
fr: Voir #ErrorStdOut pour les détails.

source: See Automating Winamp.
fr: Voir Automatiser Winamp.

source: See Concepts and Conventions for more general explanation of various concepts utilised by AutoHotkey.
fr: Voir Concepts et Conventions pour une explication plus générale de divers concepts utilisés par AutoHotkey.

source: See Functions for much more detail.
fr: Voir Fonctions pour beaucoup plus de détails.

source: See GDI+ standard library by tic.
fr: Voir la bibliothèque standard GDI+ par tic.

source: See Passing Command Line Parameters to a Script for command line usage, including a list of command line switches which affect the program's behavior.
fr: Voir Passer des Paramètre en Ligne de Commande à un Script pour l'utilisation en ligne de commande, y compris une liste des commutateurs (switches) de ligne de commande ayant un effet sur le comportement du programme.

source: See Portability of AutoHotkey.exe.
fr: Voir Portabilité de AutoHotkey.exe.

source: See Scripting Language for details about how to write a script.
fr: Voir Langage de Script pour les détails sur l'écriture d'un script.

source: See Special Keys.
fr: Voir Touches Spéciales.

source: See download page of AutoHotkey.
fr: Voir la page de téléchargement de AutoHotkey.

source: See this page for some useful scripts.
fr: Voir cette page pour des scripts utiles.

source: See Special Keys for details.
fr: Veuillez voir Touches Spéciales pour plus de détails.

source: See Functions for more details.
fr: Voir Fonctions pour plus de détails.

source: See Wikipedia's Indentation style page for various styles and examples.
fr: Voir la page Wikipédia Style d'indentation pour différents styles et exemples.

source: See also Command Line Parameter "Script Filename" and Portability of AutoHotkey.exe.
fr: Voir aussi Paramètre de Ligne de Commande "Nom du Fichier de Script" et Portabilité de AutoHotkey.exe.

source: See also object syntax.
fr: Voir aussi syntaxe d'objet.

source: Select the menu item "View->Key history"
fr: Sélectionnez l'élément de menu "View->Key History"

source: Send syntax errors that prevent a script from launching to stderr rather than displaying a dialog.
fr: Envoie les erreurs de syntaxe empêchant le lancement d'un script à stderr au lieu d'afficher une boîte de dialogue.

source: Send {KEY down}
fr: Send {TOUCHE down}

source: Send {KEY down}{KEY up}
fr: Send {TOUCHE down}{TOUCHE up}

source: Send {KEY up}
fr: Send {TOUCHE up}

source: Send, 7 lines{!}{Enter}
fr: Send, 7 lignes {!}{Enter}

source: Send, Multiple Enter lines have Enter been sent.
fr: Send, Plusieurs Enter lignes ont Enter été envoyées.

source: Send, Multiple{Enter}lines have{Enter}been sent.
fr: Send, Plusieurs{Enter}lignes ont{Enter}été envoyées.

source: Send, My First Script
fr: Send, Mon Premier Script

source: Send, The time is %A_Hour% o'clock.
fr: Send, Il est %A_Hour% heure(s).

source: Send, This text has been typed{!}
fr: Send, Ce texte a été écrit {!}

source: SendInput, This is awesome{!}{!}{!}
fr: SendInput, C'est génial {!}{!}{!}

source: SendInput, inside the CTRL{+}J hotkey.
fr: SendInput, dans la hotkey CTRL{+}J.

source: SendPlay may have no effect at all on Windows Vista or later if User Account Control is enabled, even if the script is running as an administrator.
fr: SendPlay peut n'avoir aucun effet sur Windows Vista ou version ultérieure si le contrôle de compte d'utilisateur (UAC) est activé, même si le script est lancé en tant qu'administrateur.

source: Sending Keystrokes
fr: Envoyer des Frappes

source: Sends the Alt key.
fr: Envoie la touche Alt.

source: Sends the Control (Ctrl) key.
fr: Envoie la touche Control (Ctrl).

source: Sends the Shift key.
fr: Envoie la touche Shift (majuscule).

source: Sends the Win key (the key with the Windows logo) therefore Send #e would hold down the Win key and then press the letter "e".
fr: Envoie la touche Win (la touche avec le logo Windows), ainsi Send #e maintiendrait appuyée la touche Win puis appuierait sur la lettre "e".

source: Set and remove breakpoints on lines - pause execution when a breakpoint is reached.
fr: Ajouter et enlever des points d'arrêt sur des lignes - met en pause l'exécution quand un point d'arrêt est atteint.

source: SetFormat, Integer, H is case-sensitive
fr: SetFormat, Integer, H est sensible à la casse
